`binarylane_load_balancer` has the same issue with `forwarding_rules`

Input:

```hcl
resource "binarylane_load_balancer" "load_balancer" {
  name       = "${local.cluster_id}-lb"
  server_ids = [for server in binarylane_server.workers : server.id]
}
```

Plan:

```hcl
Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # binarylane_load_balancer.load_balancer will be created
  + resource "binarylane_load_balancer" "load_balancer" {
      + forwarding_rules = (known after apply)
      + health_check     = (known after apply)
      + id               = (known after apply)
      + name             = "tf-example-k8s-lb"
      + server_ids       = [
          + 519877,
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

Apply output:

```hcl
binarylane_load_balancer.load_balancer: Creating...
╷
│ Error: Value Conversion Error
│ 
│   with binarylane_load_balancer.load_balancer,
│ An unexpected error was encountered trying to build a value. This is always an error in the provider.
│ Please report the following to the provider developer:
│ 
│ Received unknown value, however the target type cannot handle unknown values. Use the corresponding `types`
│ package type or a custom type that handles unknown values.
│ 
│ Path: 
│ Target Type: []binarylane.ForwardingRule
│ Suggested Type: basetypes.ListValue
```